In [42]:
import numpy as np

In [43]:
import pandas as pd

In [44]:
data = [5,6,12,-5,6.7]
index = ['A','B','C','D','E']

In [45]:
#Create a 1D array
s = pd.Series(data,index)

In [46]:
s

A     5.0
B     6.0
C    12.0
D    -5.0
E     6.7
dtype: float64

In [47]:
s['A']

5.0

In [48]:
data = [5,6,12,-5,6.7,2.5]
index = ['A','B','C','D','E','C']

In [49]:
s1 = pd.Series(data,index)

In [50]:
s1

A     5.0
B     6.0
C    12.0
D    -5.0
E     6.7
C     2.5
dtype: float64

In [51]:
s1['C']

C    12.0
C     2.5
dtype: float64

In [52]:
## A dataframe is ndarray in Pandas
df = pd.DataFrame(np.random.randn(4,5),['A','B','C','D'],[1,2,3,4,5])

In [53]:
df

          1         2         3         4         5
A  0.504054  0.701087  0.294961 -0.093950  0.270078
B  0.349160  0.329330 -1.057752  0.102280 -0.910026
C -0.052950 -1.003928  0.094832 -0.303717  1.085328
D -0.087951 -1.354960 -0.690278 -0.559218  1.188701

In [54]:
# Display values in the 5th column
df[5]

A    0.270078
B   -0.910026
C    1.085328
D    1.188701
Name: 5, dtype: float64

In [55]:
# Display values in second row (row labeled 'B')
df.loc['B']

1    0.349160
2    0.329330
3   -1.057752
4    0.102280
5   -0.910026
Name: B, dtype: float64

In [56]:
# Display value in fourth row(D) and column labeled 3
df.loc['D',3]

-0.6902778361059864

In [57]:
# Define data as a dictionary, with key being the column name and values being the values for each column

data = {'foo':[0,4,8,-12,16],
      'bar':['x','y','z','w','a'],
      'baz':[2.7,6,10,'NA',18],
      'qux':['True','True','False','False','False']
    
}
# Asisgn the row names for the Data frame
df1 = pd.DataFrame(data,index=['A','B','C','D','E'])

In [58]:
df1

   foo bar  baz    qux
A    0   x  2.7   True
B    4   y    6   True
C    8   z   10  False
D  -12   w   NA  False
E   16   a   18  False

In [59]:
# Display values in column labeled 'foo'
df1['foo']

A     0
B     4
C     8
D   -12
E    16
Name: foo, dtype: int64

In [60]:
# Define the observation labeled C (row C)
df1.loc['C']

foo        8
bar        z
baz       10
qux    False
Name: C, dtype: object

In [61]:
# Value in cell corresponding to row labeled 'D' and column labeled 'foo'
df1.loc['D','foo']

-12

In [62]:
# Value in cell corresponding to row labeled 'D' and column labeled 'foo' by the integer indices just 
# like in a numpy array
df1.iloc[3,3]

'False'

In [63]:
# Values in two columns. A dataframe will be returned
df1[['foo','baz']]

   foo  baz
A    0  2.7
B    4    6
C    8   10
D  -12   NA
E   16   18

In [64]:
# Verify that a single column display returns a panda Series
type(df1['foo'])

pandas.core.series.Series

In [65]:
# Verify that a multi-column display returns a panda DataFrame
type(df1[['foo','baz']])

pandas.core.frame.DataFrame

In [66]:
df

          1         2         3         4         5
A  0.504054  0.701087  0.294961 -0.093950  0.270078
B  0.349160  0.329330 -1.057752  0.102280 -0.910026
C -0.052950 -1.003928  0.094832 -0.303717  1.085328
D -0.087951 -1.354960 -0.690278 -0.559218  1.188701

In [67]:
## Return a dataframe corresponding to more than one row and column
df.loc[['A','B'],[3,4]]

          3        4
A  0.294961 -0.09395
B -1.057752  0.10228

In [68]:
## Add a new column to an existing dataFrame
df['newColumn']=pd.Series(['abc','def','ghi','jkl'],index=['A','B','C','D'])

In [69]:
df

          1         2         3         4         5 newColumn
A  0.504054  0.701087  0.294961 -0.093950  0.270078       abc
B  0.349160  0.329330 -1.057752  0.102280 -0.910026       def
C -0.052950 -1.003928  0.094832 -0.303717  1.085328       ghi
D -0.087951 -1.354960 -0.690278 -0.559218  1.188701       jkl

In [70]:
## Drop a column from the DataFrame
df.drop(3,axis=1)

          1         2         4         5 newColumn
A  0.504054  0.701087 -0.093950  0.270078       abc
B  0.349160  0.329330  0.102280 -0.910026       def
C -0.052950 -1.003928 -0.303717  1.085328       ghi
D -0.087951 -1.354960 -0.559218  1.188701       jkl

In [71]:
# Drop a row from the dataFrame
df.drop('C',axis=0)

          1         2         3         4         5 newColumn
A  0.504054  0.701087  0.294961 -0.093950  0.270078       abc
B  0.349160  0.329330 -1.057752  0.102280 -0.910026       def
D -0.087951 -1.354960 -0.690278 -0.559218  1.188701       jkl

In [72]:
## The column and the row dropped in the previous two steps is not permanent
df

          1         2         3         4         5 newColumn
A  0.504054  0.701087  0.294961 -0.093950  0.270078       abc
B  0.349160  0.329330 -1.057752  0.102280 -0.910026       def
C -0.052950 -1.003928  0.094832 -0.303717  1.085328       ghi
D -0.087951 -1.354960 -0.690278 -0.559218  1.188701       jkl

In [73]:
## To permanently drop a row or a column using a parameter, inplace= True for drop
df.drop('C',axis=0,inplace=True)

In [74]:
df

          1         2         3         4         5 newColumn
A  0.504054  0.701087  0.294961 -0.093950  0.270078       abc
B  0.349160  0.329330 -1.057752  0.102280 -0.910026       def
D -0.087951 -1.354960 -0.690278 -0.559218  1.188701       jkl